## Install Prerequisites

In [1]:
! pip install -q --upgrade google-generativeai langchain langchain-community langchain-google-genai chromadb pypdf

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 67.3/67.3 kB 2.6 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.5/2.5 MB 30.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 41.5/41.5 kB 3.9 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 611.1/611.1 kB 45.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.4/2.4 MB 85.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 298.0/298.0 kB 22.1 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 278.6/278.6 kB 25.8 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 94.8/94.8 kB 10.2 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.9/1.9 MB 75.6 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 94.8/94.8 kB 9.8 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 13.3/13.3 MB 99.7 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 55.8/55.8 kB 5.6 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 64.7/64.7 kB 7.1 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 319.7/319.7 kB 27.2 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 62.3/62.3 kB 5.8 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 459.8/459.8 kB 35.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 49.6/49.6 kB 4.9 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 73.2/73.2 kB 7.7 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 4.0/4.0 MB 82.9 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 452.6/452.6 kB 37.8 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 46.0/46.0 kB 4.7 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 86.8/86.8 kB 8.9 MB/s eta 0:00:00
  Building wheel for pypika (pyproject.toml) ... done
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
tensorflow 2.17.1 requires protobuf!=4.21.0,!=4.21.1,!=4.21.2,!=4.21.3,!=4.21.4,!=4.21.5,<5.0.0dev,>=3.20.3, but you have protobuf 5.29.3 which is incompatible.

## Configure the API Key

In [22]:
import os
import google.generativeai as genai
from google.colab import userdata
apikey="your api key"

genai.configure(api_key=apikey)

In [23]:
import urllib
import warnings
from pathlib import Path as p
from pprint import pprint

import pandas as pd
from langchain import PromptTemplate
from langchain.chains.question_answering import load_qa_chain
from langchain.document_loaders import PyPDFLoader
from langchain.text_splitter import RecursiveCharacterTextSplitter
from langchain.vectorstores import Chroma
from langchain.chains import RetrievalQA
from langchain_google_genai import ChatGoogleGenerativeAI
warnings.filterwarnings("ignore")

In [24]:
model = ChatGoogleGenerativeAI(
    model="gemini-pro",
    google_api_key= apikey,
    temperature=0.7,
    convert_system_message_to_human=True
)

## build QnA System using PDF Data Integration

In [25]:
from pathlib import Path

file_path = Path("/content/drive/MyDrive/Oracle Notes.pdf")
if file_path.exists():
    print("File exists and is ready for processing.")
else:
    print("File does not exist. Please upload it.")

File exists and is ready for processing.

In [26]:
from langchain_community.document_loaders import PyPDFLoader

pdf_loader = PyPDFLoader("/content/drive/MyDrive/Oracle Notes.pdf")
pages = pdf_loader.load_and_split()
print(pages)

[Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 1}, page_content='Class-1 \nTypes of data \nWe have two types of data. \n1)Unstructured Data \n2)Structured Data \n \n1)Unstructured Data \n\uf0b7 Data which is not in readable format is called unstructured data. \n\uf0b7 In general, meaning less data is called unstructured data.  \n \nex: \n 302 willorro Lakemba  SYD NSW \n  \n2)Structured Data \n\uf0b7 Data which is in readable format is called structured data.  \n\uf0b7 In general, meaning full data is called structured data. \n \nex: \n unit  street  Locality  City  State \n 302  willorro Lakemba  SYD  NSW \nClient-Server Architecture \nIn this architecture we need to see how our frontend data will store in backend.  \nDiagram: oracle1.1'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 2}, page_content='FrontEnd \nThe one which is visible to the enduser to perform some operations is called \nfrontend. \nex: \n Java, Python, .Net, Perl, D2K and etc. \nCommunication Channel \nIt acts like a bridge between frontend and backend.  \nex: \n JDBC - Java Database Connectivity \n ODBC - Open Database Connectivity \n PDBC - Python Database Connectivity \n \nBackEnd \nThe one which is not visible to the enduser but it performs some operations \nbased on the instructions given by frontend is called backend.  \n \nex: \n Oracle, MySQL, NoSQL, H2 , Sybase, Teradata , PostgreSQL and etc.  \nManagement System \n\uf0b7 It is a software which is used to manage the database.  \n\uf0b7 Management system will perform following acitivities very easily.'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 3}, page_content='1)Adding the new data \n2)Updating the existing data \n3)Deleting the unnecessary data \n4)Selecting a required data \n \nDBMS \nA database along with software which is used to manage the database is called \ndatabase management system. \nRDBMS \nAny database which is developed based on relational theories is called relational \ndatabase management system. \nex: \n Oracle  \n MySQL \n NoSQL \n SQL Server  \n and etc. \n \nQ) What is Oracle ? \n\uf0b7 Oracle is one of the database which is used to store structured data.  \n\uf0b7 Oracle is a product of Oracle Corporation. \n\uf0b7 Oracle is classified into two types. \n \n    Oracle  \n |----------------------------------------------------------| \n SQL      PL/SQL \n (Structured Query Language)  (Procedural/ Structured Query Language)'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 4}, page_content='SQL \n\uf0b7 SQL stands for Structured Query Language which is pronounce as \nSEQUEL. \n\uf0b7 It is used to communicate with Oracle database only. \n\uf0b7 It is a case insensitive language. \n\uf0b7 It is a command based language. \n\uf0b7 Every command must starts with verb. \nex: \n insert, update, delete, merge and etc. \n\uf0b7 Every command must ends with semicolon only. \n\uf0b7 It is a language developed by Mr.Codd(By IBM) in 1972.  \n \nSub languages of SQL \nWe have five sub languages of SQL. \n1)DDL - (Data Definition Language) \n2)DML - (Data Manipulation Language) \n3)DRL - (Data retrieve Language) \n4)DCL - (Data Control Language) \n5)TCL - (Transaction Control Language) \n \n1)DDL - (Data Definition Language) \nThis language is used to maintain the data base objects. \nIt is a collection of five commands. \nex: \n create, alter, drop, truncate and rename. \n \n2)DML - (Data Manipulation Language) \nThis language is used to manipulate the data present in database.'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 5}, page_content='It is a collection of four commends. \nex: \n insert, update, delete and merge. \n \n3)DRL - (Data retrieve Language) \nIt is used to retrieve the data present in database. \nIt is a collection of one command. \nex: \n select  \n \n4)DCL - (Data Control Language) \nThis language is used to control the access of data to the user. \nIt is a collection of two commands. \nex: \n grant and revoke \n5)TCL - (Transaction Control Language) \nThis language is used to maintain the transaction of database.  \nIt is a collection of three commands. \nex: \n commit, rollback and savepoint. \n \nWhat is Table \n\uf0b7 Table is an object which is used to store the data. \n\uf0b7 In general, table is a collection of rows and columns. \n\uf0b7 SQL is a case insensitive language but data which is present in a table is a \ncase sensitive. \n \nex:'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 6}, page_content='S No. S Name S ADD \n101 Alan USA \n102 Jose UK \n103 Mark UAE \n \nOracle Database Installation \nDatabase : Oracle  \n \nversion  : 10g / 11g   \n \nVendor  : Oracle Corporation \n \nwebsite : www.oracle.com  \n \nOpen source : Open source \ndownload link  :  \n \nhttps://drive.google.com/file/d/0B9rC21sL6v0td1NDZXpkUy1oMm8/view?usp\n=sharing&resourcekey=0-aKooR3NmAh_eLo_qGw_inA \nusername : system (default) \npassword:  admin \nconfirm password: admin \nEstablish the connection with database software \nTo perform or execute any query in a database we need to use establish the \nconnection with database software. \nOnce the work with database is completed we need to disconnect with database \nsoftware. \nex:1'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 7}, page_content='SQL> connect  \n username: system \n password: admin \nSQL> disconnect \n \nex:2 \nSQL>  conn \n username: system \n password: admin \nSQL>  disc   \nex:3 \nSQL>  conn system/admin \nSQL>  disc  \ncreate command \nIt is used to create a table in database. \n \nsyntax: \ncreate table <table_name> (col1 datatype(size), col2 datatype(size),...,  \n    colN datatype(size)); \n \nex: \n create table student(sno number(3),  \n    sname varchar2(10), \n       sadd  varchar2(12)); \n \n create table dept(deptno number(3), \n    dname varchar2(10),'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 8}, page_content="dloc varchar2(8)); \n \n create table emp(eno number(3), \n     ename varchar2(10), \n       esal number(10,2), \n         deptno number(3), \n    job  varchar2(10), \n      comm  number(6)); \n \ndescribe command \nIt is used to see the structure of a table. \n \nsyntax: \n desc  <table_name>; \nex: \n desc emp; \n desc student; \n desc dept; \n \nClass-2 \ninsert command \nIt is used to insert a row in a database table. \nsyntax: \n insert into <table_name> values(val1,val2,.....,valN);  \nex: \n insert into student values(101,raja,hyd); // invalid  \ninsert into student values(101,'raja','hyd'); // valid"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 9}, page_content="insert into student values('ravi',102,'pune'); // invalid  \ninsert into student values(102,'ravi');  // invalid  \nnull \n null is keyword which represent undefined or unavailable.  \n \nex: \n insert into student values(102,'ravi',null); // valid  \n \napproach2 \n insert into student(sno,sname,sadd) values(103,'ramana','delhi'); \n insert into student(sno,sname) values(104,'raja'); \n \napproach3 \n We can insert dynamic inputs by using '&' symbol. \n ex: \n insert into student values(&sno,'&sname','&sadd'); \ncommit command \nIt is used to make the changes permanent to database. \nsyntax: \n commit; \nselect command \nIt is used to select /retrieve the records from database table.  \nsyntax: \n select * from <table_name>; \nHere '*' means all rows and columns. \nex: \n select * from student;"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 10}, page_content="select * from emp; \n select * from dept; \nemp table \ncreate table emp(eno number(3),ename varchar2(10),esal number(10,2),deptno \nnumber(3), \n     job varchar2(10), comm number(5)); \ninsert into emp values(201,'Alan',8000,10,'Clerk',null);  \ninsert into emp values(202,'Jose',12000,10,'Clerk',100);  \ninsert into emp values(203,'Nancy',27000,20,'HR',200); \ninsert into emp values(204,'Lucy',36000,20,'HR',500); \ninsert into emp values(205,'Mark',45000,30,'Manager',500);  \ninsert into emp values(206,'James',28000,30,'Manager',900);  \n \ncommit;  \ndept table \ncreate table dept(deptno number(3),dname varchar2(10),dloc varchar2(12));  \ninsert into dept values(10,'ECE','HYD'); \ninsert into dept values(20,'EEE','DELHI'); \ninsert into dept values(30,'CSE','VIZAG'); \ninsert into dept values(40,'MEC','PUNE'); \ncommit; \nProjection: \nSelecting specific columns from the database table is called projection.  \nex: \n select sno from student; \n select sno,sname from student; \n select sno,sname,sadd from student; \ncolumn alias"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 11}, page_content='A userdefine heading given to a column is called column alias.  \nColumn alias we can apply to any column. \nScope of column alias is with respect to same column. It means when query is \nexecuted we will loss the column alias. \nex: \n select sno,sname,sadd from student; \n select sno as rollno, \n   sname as firstname, \n    sadd as city from student; \nInterview queries \nQ) Write a query to display all the tables present in database?  \n \n select * from tab; \n \nQ) Write a query to see the logical database name(schema name)?  \n \n select * from global_name; \n \nQ) Write a query to see the list of users present in database? \n \n select * from all_users; \n \nQ) write a query to  display all the employees information from emp table?  \n \n select * from emp; \n \nQ) write a query to display employee no,employee name and salary from \nemp table?'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 12}, page_content="select eno,ename,esal from emp; \n \nQ) Write a query to display employee number, employee name , employee \nsalary and annual salary from emp table? \n \n select eno,ename,esal,esal*12 from emp;  \n \nQ) Write a query to display employee number, employee name ,  employee \nsalary and annual salary as ANNUAL_SAL from emp table?  \n \n select eno,ename,esal,esal*12 as ANNUAL_SAL from emp;   \n \nWhere clause \nTo select specific records from database table then we need to use where clause.  \n \nsyntax: \n select * from <table_name> where condition; \n \nex: \n select * from student where sno=101; \n \n \n select * from student where sname='rakesh'; // no rows selected  \n \n select * from student where sname='Rakesh'; \n \n select * from student where sadd='hyd';"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 13}, page_content="Interview queries \nQ) Write a query to display employees information those who are working \nin 10 dept? \nselect * from emp where deptno=10; \n  \nQ) Write a query to display employees information those who are working \nas a Manager? \n \n select * from emp where job='Manager'; \n \nQ) Write a query to display employee information whose salary is greater \nthen 25000? \nselect * from emp where esal>25000; \n \nQ) Write a query to display employee information whose commission is \nnull? \nselect * from emp where comm=null; // no rows selected. \nselect * from emp where comm is null;  \nupdate command \nIt is used to update the records in database table. \n \nsyntax: \n update <table_name> set <col_name>=value where condition;  \n \nex: \n update student set sname='gogo' where sno=101;  \n \n update student set sadd='hyd' where sno=102;"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 14}, page_content="update student set sname='jojo',sadd='delhi' where sno=103;  \n \nNote: \n If we won't use where clause then all rows will be updated.  \nex: \n update student set sname='raja'; \n \n update student set sno=101; \n \n update student set sadd='hyd'; \n \nDelete command \n=============== \nIt is used to delete the records from database table. \n \nsyntax: \n delete from <table_name> where condition; \nex: \n delete from student where sno=105; \ndelete from student where sname='raja'; \ndelete from student where sadd='hyd'; \n \nNote: \nIf we won't use where clause then all rows will be deleted. \nex: \n delete from emp;"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 15}, page_content="delete from dept; \n delete from student; \nClass-3 \nLogical Operators \nIf we want to declare more then one condition in our query then we need to use \nlogical operators. \nWe have three logical operators. \n1)AND \n2)OR \n3)NOT \n \n1)AND \nIt will return the records if all conditions are true. \nAll conditions must belongs to same row only. \nex: \n select * from emp where eno=201 and ename='Alan';  \n select * from emp where eno=202 and ename='Alan'; // NO ROWS \nSELECTED \n select * from emp where eno=202 and ename='Linda'; // no rows selected  \n select * from emp where esal>8000 and esal<30000; \n2)OR \nIt will return the records atleast one condition is true.  \nHere conditions can be from any row.  \nex: \n select * from emp where eno=201 OR ename='Alan';  \n select * from emp where eno=202 OR ename='Alan';  \n \n select * from emp where eno=202 OR ename='Linda';"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 16}, page_content="select * from emp where eno=201 OR eno=202 OR eno=203;  \n \n3)NOT \nIt will display the records except the condition. \nA '<>' symbol denoted as not operator. \nex: \n select * from emp where NOT eno=201; \n  \n select * from emp where  eno<>201; \n \nQ) write a query to display all the employees information those who are not \nworking in 10 department? \n \n select * from emp where NOT deptno=10; \nor \nselect * from emp where deptno<>10; \n \nDuplicate table or copy of a table \nWe can create a duplicate table or copy of a table by using create and select \ncommand. \nex: \n create table stud as select * from emp; \n create table stud as select eno,ename,esal from emp; \n create table stud as select * from emp where eno=201; \n create table stud as select * from emp where esal>= 5000 and \nesal<=20000; \n create table stud as select * from emp where comm is null;"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 17}, page_content='create table stud as select * from emp where deptno<>10;  \n \ncl scr \nIT is used to clear the output screen of sql command prompt.  \nsyntax: \n cl  scr \n \nBetween operator \nIt will return the records those who are in the range of values.  \nBetween operator will take the support of AND operator. \nIn between operator we need to write first lower limit then higher limit.  \nex: \n select * from emp where eno between 201 AND 204;  \n select * from emp where deptno between 10 and 30; \n select * from emp where esal between 5000 and 20000; \n \nIn operator \nIn operator is a replacement of OR operator. \nIt will return the records those who are matching in the list of values.  \nex: \n select * from emp where eno IN(201,202,203); \n select * from emp where ename IN(\'Alan\',\'Linda\',\'Jose\'); \n select * from emp where deptno IN(10,20,30); \n \nPattern matching operators \nPattern matching operators are used to select the letters from database table.  \nPattern matching operator take the support of "like" operator.'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 18}, page_content="We have two types of pattern matching operators. \n1)Percentage (%) \n2)Underscore(_) \n \n \n1)Percentage (%) \nQ) Write a query to display employee information whose employee name \nstarts with 'A' letter? \n \nselect * from emp where ename like 'A%'; \n \nQ) Write a query to display employee information whose employee name  \nends with 'y' letter? \n \n select * from emp where ename like '%y'; \n \nQ) Write a query to display employee information whose employee name \nmiddle letter is 'n'? \n select * from emp where ename like '%n%'; \n \n2) Underscore(_) \nQ) Write a query to display employee information whose employee name \nhaving second letter is 'l'? \n \n select * from emp where ename like '_l%'; \n \nQ) Write a query to display employee information whose employee name \nhaving third letter is 'n'?"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 19}, page_content="select * from emp where ename like '__n%'; \n \nQ) Write a query to display employee information whose employee name \nhaving second last letter as 'c'? \n \n select * from emp where ename like '%c_'; \n \n \nDDL commands \ncreate -  (tables) \nalter  -  (columns) \ndrop   -  (tables) \ntruncate - (rows/records) \nrename  -  (tables) \n \nalter  command \nUsing alter command we can perform following activities. \n1)Adding a new column \n2)Dropping a existing column \n3)Modifying a column \n4)Renaming a column  \n \n1)Adding a new column \nUsing alter command we can add a new column. \nsyntax: \nalter table <table_name> ADD (col1 datatype(size),col2 datatype(size),...,colN \ndatatype(size)); \nex:"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 20}, page_content="alter table student add (state varchar2(10)); \n alter table student add (pincode number(8)); \n alter table student add (state varchar2(10),pincode number(8));  \n \n update student set state='telangana' where sno=101; \n \n2)Dropping a existing column \nUsing alter command we can drop the existing column.  \nsyntax: \n alter table <table_name> DROP (col1,col2,....,colN);  \nex: \n alter table student DROP (state); \n alter table student DROP (pincode); \n alter table student DROP (state,pincode); \n3)Modifying a column \nUsing alter command we can modify a column. \nWe can increase or decrease the size of a column only when existing values are \nfit into new size. \nWe can change the datatype of a column only when column is empty. \nex: \n desc student; \n \n alter table student modify (sadd varchar2(15)); \n \n desc student; \n \n alter table student modify (sadd number(4)); \n4)Renaming a column"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 21}, page_content='Using alter command we can rename the column name.  \n \nsyntax: \n alter table <table_name> rename column <old_name> to <new_name>;  \nex: \n alter table student rename column sadd to city; \nalter table emp rename column esal to dailywages; \nalter table emp rename column job to designation; \ndrop command \nIt is used to drop the table from database. \nsyntax: \n drop table <table_name> \nex: \n drop table emp; \n drop table student; \n drop table dept; \n \ntruncate command \nIt is used to delete the records permenently from database table.  \n \nsyntax: \n truncate table <table_name> \n \nex: \n truncate table emp;  \n truncate table dept; \n truncate table student;'), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 22}, page_content="Q) What is the difference between delete and truncate command?  \ndelete      truncate \nIt will delete the records temperorly.  It will delete the records \npermanently. \nWe can rollback the data.   We can't rollback the data. \nWhere clause can be used.   Where clause can't be used. \nIt is a DML command.    It is a DDL command. \n \nrename  command \nIt is used to rename the table name. \nsyntax: \n rename <old_name> to <new_name>; \nex: \n rename  emp to employee; \n rename student to students; \n rename dept to department; \n \nClass-4 \nFunctions \nFunctions are used to manipulate the data items and gives the result.  \n \nWe have two types of functions in SQL. \n \n1)Group Functions / Multiple Rows Functions  \n \n2)Scalar Functions / Single Row Functions"), Document(metadata={'source': '/content/drive/MyDrive/Oracle Notes.pdf', 'page': 23}, page_content='1)Group Functions \nGroup functions are applicable for multiple row

In [27]:
from langchain_google_genai import GoogleGenerativeAIEmbeddings
text_splitter = RecursiveCharacterTextSplitter(chunk_size=10000, chunk_overlap=1000)
context = "\n\n".join(str(p.page_content) for p in pages)
texts = text_splitter.split_text(context)
embeddings = GoogleGenerativeAIEmbeddings(model="models/embedding-001",google_api_key=apikey)

## Vector Indexing to make a Retrieval-Based QA System

In [28]:
vector_index = Chroma.from_texts(texts, embeddings).as_retriever(search_kwargs={"k":5})

qa_chain = RetrievalQA.from_chain_type(
    model,
    retriever=vector_index,
    return_source_documents=True

)

## Ask the Question and Displaying Output!

In [36]:
question = "What are cursors?"
result = qa_chain({"query": question})

# Extract and print the result
answer = result.get("result", "No answer found.")
print(f"Question: {question}\n")
print("Answer:")
print(answer)

Question: What are cursors?

Answer:
Cursors are used to iterate through a set of records in a database. They allow you to access and process the records one at a time, and you can control the order in which they are processed. This can be useful for tasks such as:

* Displaying data in a specific order
* Updating or deleting records in a specific order
* Processing data in a batch
* Iterating through a set of records that is too large to fit into memory all at once

Cursors are created using the `DECLARE` statement, and they are opened using the `OPEN` statement. The `FETCH` statement is used to retrieve the next record from the cursor, and the `CLOSE` statement is used to close the cursor when you are finished with it.

Here is an example of how to use a cursor to iterate through the records in a table:

```sql
DECLARE cursor_name CURSOR FOR
SELECT * FROM table_name;

OPEN cursor_name;

FETCH cursor_name INTO variable1, variable2, ...;

WHILE cursor_name%FOUND LOOP
    -- Do something with the data in the variables
    FETCH cursor_name INTO variable1, variable2, ...;
END LOOP;

CLOSE cursor_name;
```

In this example, the `DECLARE` statement creates a cursor named `cursor_name` that will be used to iterate through the records in the `table_name` table. The `OPEN` statement opens the cursor, and the `FETCH` statement retrieves the first record from the cursor and stores the data in the variables `variable1`, `variable2`, and so on. The `WHILE` loop continues to fetch records from the cursor until the `%FOUND` attribute of the cursor is `FALSE`, which indicates that there are no more records to fetch. The `CLOSE` statement closes the cursor when you are finished with it.